Revit 2027 API
EnergyAnalysisDetailModel.GetAnalyticalOpenings Method
 The collection of analytical openings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<EnergyAnalysisOpening> GetAnalyticalOpenings()
Public Function GetAnalyticalOpenings As IList(Of EnergyAnalysisOpening)
public:
IList<EnergyAnalysisOpening^>^ GetAnalyticalOpenings()
member GetAnalyticalOpenings : unit -> IList<EnergyAnalysisOpening>
Return Value
IList<EnergyAnalysisOpening>
 Returns the analytical openings after model calculation.
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace